HloModule jit__threefry_fold_in, is_scheduled=true, entry_computation_layout={(u32[2]{0}, u32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="4d9beb84f59906f0865a6e23dd8c1a67"}

%fused_concatenate (param_0.133: u32[2], param_1.200: u32[]) -> u32[2] {
  %param_1.200 = u32[] parameter(1)
  %constant_3_1 = u32[] constant(32)
  %shift-right-logical.4.19 = u32[] shift-right-logical(%param_1.200, %constant_3_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %bitcast.23 = u32[1]{0} bitcast(%shift-right-logical.4.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %param_0.133 = u32[2]{0} parameter(0)
  %slice.7.83 = u32[1]{0} slice(%param_0.133), slice={[0:1]}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/slice" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.0.21 = u32[1]{0} add(%bitcast.23, %slice.7.83), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %bitcast.1.41 = u32[1]{0} bitcast(%param_1.200), metadata={op_name="data"}
  %slice.9.99 = u32[1]{0} slice(%param_0.133), slice={[1:2]}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/slice" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.1.41 = u32[1]{0} add(%bitcast.1.41, %slice.9.99), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.2.19 = u32[1]{0} add(%add.0.21, %add.1.41), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_0_1 = u32[1]{0} constant({13})
  %shift-left.0.19 = u32[1]{0} shift-left(%add.1.41, %constant_0_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_1_1 = u32[1]{0} constant({19})
  %shift-right-logical.0.19 = u32[1]{0} shift-right-logical(%add.1.41, %constant_1_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.0.19 = u32[1]{0} or(%shift-left.0.19, %shift-right-logical.0.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.0.19 = u32[1]{0} xor(%add.2.19, %or.0.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.3.78 = u32[1]{0} add(%add.2.19, %xor.0.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_2_1 = u32[1]{0} constant({15})
  %shift-left.1.19 = u32[1]{0} shift-left(%xor.0.19, %constant_2_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_4_1 = u32[1]{0} constant({17})
  %shift-right-logical.1.19 = u32[1]{0} shift-right-logical(%xor.0.19, %constant_4_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.1.19 = u32[1]{0} or(%shift-left.1.19, %shift-right-logical.1.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.1.19 = u32[1]{0} xor(%add.3.78, %or.1.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.4.59 = u32[1]{0} add(%add.3.78, %xor.1.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_5_1 = u32[1]{0} constant({26})
  %shift-left.2.29 = u32[1]{0} shift-left(%xor.1.19, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_6_1 = u32[1]{0} constant({6})
  %shift-right-logical.2.29 = u32[1]{0} shift-right-logical(%xor.1.19, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.2.29 = u32[1]{0} or(%shift-left.2.29, %shift-right-logical.2.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.2.29 = u32[1]{0} xor(%add.4.59, %or.2.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.5.26 = u32[1]{0} add(%add.4.59, %xor.2.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.6.7 = u32[1]{0} add(%add.5.26, %slice.9.99), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.3.19 = u32[1]{0} shift-left(%xor.2.29, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.3.19 = u32[1]{0} shift-right-logical(%xor.2.29, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.3.19 = u32[1]{0} or(%shift-left.3.19, %shift-right-logical.3.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.3.19 = u32[1]{0} xor(%add.5.26, %or.3.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.22.39 = u32[1]{0} xor(%slice.7.83, %slice.9.99), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_33_1 = u32[1]{0} constant({466688986})
  %xor.23.39 = u32[1]{0} xor(%xor.22.39, %constant_33_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.7.19 = u32[1]{0} add(%xor.3.19, %xor.23.39), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_8_1 = u32[1]{0} constant({1})
  %add.8.19 = u32[1]{0} add(%add.7.19, %constant_8_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.9.7 = u32[1]{0} add(%add.6.7, %add.8.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.4.9 = u32[1]{0} shift-left(%add.8.19, %constant_4_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.5.9 = u32[1]{0} shift-right-logical(%add.8.19, %constant_2_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.4.9 = u32[1]{0} or(%shift-left.4.9, %shift-right-logical.5.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.6.9 = u32[1]{0} xor(%add.9.7, %or.4.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.10.88 = u32[1]{0} add(%add.9.7, %xor.6.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_9_1 = u32[1]{0} constant({29})
  %shift-left.5.21 = u32[1]{0} shift-left(%xor.6.9, %constant_9_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_10_1 = u32[1]{0} constant({3})
  %shift-right-logical.6.21 = u32[1]{0} shift-right-logical(%xor.6.9, %constant_10_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.5.21 = u32[1]{0} or(%shift-left.5.21, %shift-right-logical.6.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.7.21 = u32[1]{0} xor(%add.10.88, %or.5.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.11.67 = u32[1]{0} add(%add.10.88, %xor.7.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_11_1 = u32[1]{0} constant({16})
  %shift-left.6.33 = u32[1]{0} shift-left(%xor.7.21, %constant_11_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.7.33 = u32[1]{0} shift-right-logical(%xor.7.21, %constant_11_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.6.33 = u32[1]{0} or(%shift-left.6.33, %shift-right-logical.7.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.8.33 = u32[1]{0} xor(%add.11.67, %or.6.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.12.30 = u32[1]{0} add(%add.11.67, %xor.8.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.13.9 = u32[1]{0} add(%add.12.30, %xor.23.39), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_12_1 = u32[1]{0} constant({24})
  %shift-left.7.21 = u32[1]{0} shift-left(%xor.8.33, %constant_12_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_13_1 = u32[1]{0} constant({8})
  %shift-right-logical.8.21 = u32[1]{0} shift-right-logical(%xor.8.33, %constant_13_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.7.21 = u32[1]{0} or(%shift-left.7.21, %shift-right-logical.8.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.9.21 = u32[1]{0} xor(%add.12.30, %or.7.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.14.21 = u32[1]{0} add(%xor.9.21, %slice.7.83), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_14_1 = u32[1]{0} constant({2})
  %add.15.21 = u32[1]{0} add(%add.14.21, %constant_14_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.16.9 = u32[1]{0} add(%add.13.9, %add.15.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.8.9 = u32[1]{0} shift-left(%add.15.21, %constant_0_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.9.9 = u32[1]{0} shift-right-logical(%add.15.21, %constant_1_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.8.9 = u32[1]{0} or(%shift-left.8.9, %shift-right-logical.9.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.10.9 = u32[1]{0} xor(%add.16.9, %or.8.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.17.40 = u32[1]{0} add(%add.16.9, %xor.10.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.9.9 = u32[1]{0} shift-left(%xor.10.9, %constant_2_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.10.9 = u32[1]{0} shift-right-logical(%xor.10.9, %constant_4_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.9.9 = u32[1]{0} or(%shift-left.9.9, %shift-right-logical.10.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.11.9 = u32[1]{0} xor(%add.17.40, %or.9.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.18.31 = u32[1]{0} add(%add.17.40, %xor.11.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.10.15 = u32[1]{0} shift-left(%xor.11.9, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.11.15 = u32[1]{0} shift-right-logical(%xor.11.9, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.10.15 = u32[1]{0} or(%shift-left.10.15, %shift-right-logical.11.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.12.15 = u32[1]{0} xor(%add.18.31, %or.10.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.19.12 = u32[1]{0} add(%add.18.31, %xor.12.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.20.3 = u32[1]{0} add(%add.19.12, %slice.7.83), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.11.9 = u32[1]{0} shift-left(%xor.12.15, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.12.9 = u32[1]{0} shift-right-logical(%xor.12.15, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.11.9 = u32[1]{0} or(%shift-left.11.9, %shift-right-logical.12.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.13.9 = u32[1]{0} xor(%add.19.12, %or.11.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.21.9 = u32[1]{0} add(%xor.13.9, %slice.9.99), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.22.9 = u32[1]{0} add(%add.21.9, %constant_10_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.23.3 = u32[1]{0} add(%add.20.3, %add.22.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.12.3 = u32[1]{0} shift-left(%add.22.9, %constant_4_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.13.3 = u32[1]{0} shift-right-logical(%add.22.9, %constant_2_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.12.3 = u32[1]{0} or(%shift-left.12.3, %shift-right-logical.13.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.14.3 = u32[1]{0} xor(%add.23.3, %or.12.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.24.40 = u32[1]{0} add(%add.23.3, %xor.14.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.13.9 = u32[1]{0} shift-left(%xor.14.3, %constant_9_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.14.9 = u32[1]{0} shift-right-logical(%xor.14.3, %constant_10_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.13.9 = u32[1]{0} or(%shift-left.13.9, %shift-right-logical.14.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.15.9 = u32[1]{0} xor(%add.24.40, %or.13.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.25.31 = u32[1]{0} add(%add.24.40, %xor.15.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.14.15 = u32[1]{0} shift-left(%xor.15.9, %constant_11_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.15.15 = u32[1]{0} shift-right-logical(%xor.15.9, %constant_11_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.14.15 = u32[1]{0} or(%shift-left.14.15, %shift-right-logical.15.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.16.15 = u32[1]{0} xor(%add.25.31, %or.14.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.26.12 = u32[1]{0} add(%add.25.31, %xor.16.15), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.27.3 = u32[1]{0} add(%add.26.12, %slice.9.99), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.15.9 = u32[1]{0} shift-left(%xor.16.15, %constant_12_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.16.9 = u32[1]{0} shift-right-logical(%xor.16.15, %constant_13_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.15.9 = u32[1]{0} or(%shift-left.15.9, %shift-right-logical.16.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.17.9 = u32[1]{0} xor(%add.26.12, %or.15.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.28.9 = u32[1]{0} add(%xor.17.9, %xor.23.39), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_15_1 = u32[1]{0} constant({4})
  %add.29.9 = u32[1]{0} add(%add.28.9, %constant_15_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.30.3 = u32[1]{0} add(%add.27.3, %add.29.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.16.3 = u32[1]{0} shift-left(%add.29.9, %constant_0_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.17.3 = u32[1]{0} shift-right-logical(%add.29.9, %constant_1_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.16.3 = u32[1]{0} or(%shift-left.16.3, %shift-right-logical.17.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.18.3 = u32[1]{0} xor(%add.30.3, %or.16.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.31.6 = u32[1]{0} add(%add.30.3, %xor.18.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.17.3 = u32[1]{0} shift-left(%xor.18.3, %constant_2_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.18.3 = u32[1]{0} shift-right-logical(%xor.18.3, %constant_4_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.17.3 = u32[1]{0} or(%shift-left.17.3, %shift-right-logical.18.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.19.3 = u32[1]{0} xor(%add.31.6, %or.17.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.32.5 = u32[1]{0} add(%add.31.6, %xor.19.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.18.3 = u32[1]{0} shift-left(%xor.19.3, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.19.3 = u32[1]{0} shift-right-logical(%xor.19.3, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.18.3 = u32[1]{0} or(%shift-left.18.3, %shift-right-logical.19.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.20.3 = u32[1]{0} xor(%add.32.5, %or.18.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.33.1 = u32[1]{0} add(%add.32.5, %xor.20.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.34.1 = u32[1]{0} add(%add.33.1, %xor.23.39), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.19.1 = u32[1]{0} shift-left(%xor.20.3, %constant_6_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.20.1 = u32[1]{0} shift-right-logical(%xor.20.3, %constant_5_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.19.1 = u32[1]{0} or(%shift-left.19.1, %shift-right-logical.20.1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.21.1 = u32[1]{0} xor(%add.33.1, %or.19.1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.36.1 = u32[1]{0} add(%xor.21.1, %slice.7.83), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant_32_1 = u32[1]{0} constant({5})
  %add.39.1 = u32[1]{0} add(%add.36.1, %constant_32_1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  ROOT %concatenate.167.1 = u32[2]{0} concatenate(%add.34.1, %add.39.1), dimensions={0}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/concatenate" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
}

ENTRY %main.168 (Arg_0.1: u32[2], Arg_1.2: u32[]) -> u32[2] {
  %Arg_1.2 = u32[] parameter(1), metadata={op_name="data"}
  %Arg_0.1 = u32[2]{0} parameter(0), metadata={op_name="key"}
  ROOT %input_concatenate_fusion = u32[2]{0} fusion(%Arg_0.1, %Arg_1.2), kind=kInput, calls=%fused_concatenate, metadata={op_name="jit(_threefry_fold_in)/jit(main)/concatenate" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
}

