HloModule jit__threefry_fold_in, entry_computation_layout={(u32[2]{0}, u32[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

%threefry2x32.11 (Arg_0.12: u32[], Arg_1.13: u32[], Arg_2.14: u32[1], Arg_3.15: u32[1]) -> (u32[1], u32[1]) {
  %Arg_2.14 = u32[1]{0} parameter(2), metadata={op_name="jit(_threefry_fold_in)/jit(main)/threefry2x32"}
  %Arg_0.12 = u32[] parameter(0), metadata={op_name="jit(_threefry_fold_in)/jit(main)/threefry2x32"}
  %reshape.34 = u32[1]{0} reshape(%Arg_0.12), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.35 = u32[1]{0} add(%Arg_2.14, %reshape.34), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %Arg_3.15 = u32[1]{0} parameter(3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/threefry2x32"}
  %Arg_1.13 = u32[] parameter(1), metadata={op_name="jit(_threefry_fold_in)/jit(main)/threefry2x32"}
  %reshape.36 = u32[1]{0} reshape(%Arg_1.13), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.37 = u32[1]{0} add(%Arg_3.15, %reshape.36), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.38 = u32[1]{0} add(%add.35, %add.37), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.30 = u32[1]{0} constant({13})
  %shift-left.39 = u32[1]{0} shift-left(%add.37, %constant.30), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.29 = u32[1]{0} constant({19})
  %shift-right-logical.40 = u32[1]{0} shift-right-logical(%add.37, %constant.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.41 = u32[1]{0} or(%shift-left.39, %shift-right-logical.40), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.42 = u32[1]{0} xor(%add.38, %or.41), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.43 = u32[1]{0} add(%add.38, %xor.42), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.28 = u32[1]{0} constant({15})
  %shift-left.44 = u32[1]{0} shift-left(%xor.42, %constant.28), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.27 = u32[1]{0} constant({17})
  %shift-right-logical.45 = u32[1]{0} shift-right-logical(%xor.42, %constant.27), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.46 = u32[1]{0} or(%shift-left.44, %shift-right-logical.45), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.47 = u32[1]{0} xor(%add.43, %or.46), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.48 = u32[1]{0} add(%add.43, %xor.47), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.26 = u32[1]{0} constant({26})
  %shift-left.49 = u32[1]{0} shift-left(%xor.47, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.25 = u32[1]{0} constant({6})
  %shift-right-logical.50 = u32[1]{0} shift-right-logical(%xor.47, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.51 = u32[1]{0} or(%shift-left.49, %shift-right-logical.50), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.52 = u32[1]{0} xor(%add.48, %or.51), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.53 = u32[1]{0} add(%add.48, %xor.52), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.58 = u32[1]{0} reshape(%Arg_1.13), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.59 = u32[1]{0} add(%add.53, %reshape.58), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.54 = u32[1]{0} shift-left(%xor.52, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.55 = u32[1]{0} shift-right-logical(%xor.52, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.56 = u32[1]{0} or(%shift-left.54, %shift-right-logical.55), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.57 = u32[1]{0} xor(%add.53, %or.56), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.32 = u32[] xor(%Arg_0.12, %Arg_1.13), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.31 = u32[] constant(466688986)
  %xor.33 = u32[] xor(%xor.32, %constant.31), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.60 = u32[1]{0} reshape(%xor.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.61 = u32[1]{0} add(%xor.57, %reshape.60), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.24 = u32[1]{0} constant({1})
  %add.62 = u32[1]{0} add(%add.61, %constant.24), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.63 = u32[1]{0} add(%add.59, %add.62), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.64 = u32[1]{0} shift-left(%add.62, %constant.27), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.65 = u32[1]{0} shift-right-logical(%add.62, %constant.28), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.66 = u32[1]{0} or(%shift-left.64, %shift-right-logical.65), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.67 = u32[1]{0} xor(%add.63, %or.66), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.68 = u32[1]{0} add(%add.63, %xor.67), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.23 = u32[1]{0} constant({29})
  %shift-left.69 = u32[1]{0} shift-left(%xor.67, %constant.23), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.22 = u32[1]{0} constant({3})
  %shift-right-logical.70 = u32[1]{0} shift-right-logical(%xor.67, %constant.22), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.71 = u32[1]{0} or(%shift-left.69, %shift-right-logical.70), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.72 = u32[1]{0} xor(%add.68, %or.71), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.73 = u32[1]{0} add(%add.68, %xor.72), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.21 = u32[1]{0} constant({16})
  %shift-left.74 = u32[1]{0} shift-left(%xor.72, %constant.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.75 = u32[1]{0} shift-right-logical(%xor.72, %constant.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.76 = u32[1]{0} or(%shift-left.74, %shift-right-logical.75), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.77 = u32[1]{0} xor(%add.73, %or.76), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.78 = u32[1]{0} add(%add.73, %xor.77), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.83 = u32[1]{0} reshape(%xor.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.84 = u32[1]{0} add(%add.78, %reshape.83), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.20 = u32[1]{0} constant({24})
  %shift-left.79 = u32[1]{0} shift-left(%xor.77, %constant.20), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.19 = u32[1]{0} constant({8})
  %shift-right-logical.80 = u32[1]{0} shift-right-logical(%xor.77, %constant.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.81 = u32[1]{0} or(%shift-left.79, %shift-right-logical.80), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.82 = u32[1]{0} xor(%add.78, %or.81), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.85 = u32[1]{0} reshape(%Arg_0.12), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.86 = u32[1]{0} add(%xor.82, %reshape.85), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.18 = u32[1]{0} constant({2})
  %add.87 = u32[1]{0} add(%add.86, %constant.18), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.88 = u32[1]{0} add(%add.84, %add.87), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.89 = u32[1]{0} shift-left(%add.87, %constant.30), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.90 = u32[1]{0} shift-right-logical(%add.87, %constant.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.91 = u32[1]{0} or(%shift-left.89, %shift-right-logical.90), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.92 = u32[1]{0} xor(%add.88, %or.91), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.93 = u32[1]{0} add(%add.88, %xor.92), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.94 = u32[1]{0} shift-left(%xor.92, %constant.28), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.95 = u32[1]{0} shift-right-logical(%xor.92, %constant.27), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.96 = u32[1]{0} or(%shift-left.94, %shift-right-logical.95), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.97 = u32[1]{0} xor(%add.93, %or.96), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.98 = u32[1]{0} add(%add.93, %xor.97), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.99 = u32[1]{0} shift-left(%xor.97, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.100 = u32[1]{0} shift-right-logical(%xor.97, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.101 = u32[1]{0} or(%shift-left.99, %shift-right-logical.100), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.102 = u32[1]{0} xor(%add.98, %or.101), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.103 = u32[1]{0} add(%add.98, %xor.102), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.108 = u32[1]{0} reshape(%Arg_0.12), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.109 = u32[1]{0} add(%add.103, %reshape.108), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.104 = u32[1]{0} shift-left(%xor.102, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.105 = u32[1]{0} shift-right-logical(%xor.102, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.106 = u32[1]{0} or(%shift-left.104, %shift-right-logical.105), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.107 = u32[1]{0} xor(%add.103, %or.106), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.110 = u32[1]{0} reshape(%Arg_1.13), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.111 = u32[1]{0} add(%xor.107, %reshape.110), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.112 = u32[1]{0} add(%add.111, %constant.22), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.113 = u32[1]{0} add(%add.109, %add.112), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.114 = u32[1]{0} shift-left(%add.112, %constant.27), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.115 = u32[1]{0} shift-right-logical(%add.112, %constant.28), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.116 = u32[1]{0} or(%shift-left.114, %shift-right-logical.115), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.117 = u32[1]{0} xor(%add.113, %or.116), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.118 = u32[1]{0} add(%add.113, %xor.117), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.119 = u32[1]{0} shift-left(%xor.117, %constant.23), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.120 = u32[1]{0} shift-right-logical(%xor.117, %constant.22), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.121 = u32[1]{0} or(%shift-left.119, %shift-right-logical.120), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.122 = u32[1]{0} xor(%add.118, %or.121), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.123 = u32[1]{0} add(%add.118, %xor.122), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.124 = u32[1]{0} shift-left(%xor.122, %constant.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.125 = u32[1]{0} shift-right-logical(%xor.122, %constant.21), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.126 = u32[1]{0} or(%shift-left.124, %shift-right-logical.125), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.127 = u32[1]{0} xor(%add.123, %or.126), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.128 = u32[1]{0} add(%add.123, %xor.127), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.133 = u32[1]{0} reshape(%Arg_1.13), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.134 = u32[1]{0} add(%add.128, %reshape.133), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.129 = u32[1]{0} shift-left(%xor.127, %constant.20), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.130 = u32[1]{0} shift-right-logical(%xor.127, %constant.19), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.131 = u32[1]{0} or(%shift-left.129, %shift-right-logical.130), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.132 = u32[1]{0} xor(%add.128, %or.131), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.135 = u32[1]{0} reshape(%xor.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.136 = u32[1]{0} add(%xor.132, %reshape.135), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.17 = u32[1]{0} constant({4})
  %add.137 = u32[1]{0} add(%add.136, %constant.17), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.138 = u32[1]{0} add(%add.134, %add.137), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.139 = u32[1]{0} shift-left(%add.137, %constant.30), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.140 = u32[1]{0} shift-right-logical(%add.137, %constant.29), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.141 = u32[1]{0} or(%shift-left.139, %shift-right-logical.140), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.142 = u32[1]{0} xor(%add.138, %or.141), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.143 = u32[1]{0} add(%add.138, %xor.142), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.144 = u32[1]{0} shift-left(%xor.142, %constant.28), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.145 = u32[1]{0} shift-right-logical(%xor.142, %constant.27), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.146 = u32[1]{0} or(%shift-left.144, %shift-right-logical.145), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.147 = u32[1]{0} xor(%add.143, %or.146), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.148 = u32[1]{0} add(%add.143, %xor.147), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.149 = u32[1]{0} shift-left(%xor.147, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.150 = u32[1]{0} shift-right-logical(%xor.147, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.151 = u32[1]{0} or(%shift-left.149, %shift-right-logical.150), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.152 = u32[1]{0} xor(%add.148, %or.151), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.153 = u32[1]{0} add(%add.148, %xor.152), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.158 = u32[1]{0} reshape(%xor.33), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.159 = u32[1]{0} add(%add.153, %reshape.158), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-left.154 = u32[1]{0} shift-left(%xor.152, %constant.25), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_left" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %shift-right-logical.155 = u32[1]{0} shift-right-logical(%xor.152, %constant.26), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %or.156 = u32[1]{0} or(%shift-left.154, %shift-right-logical.155), metadata={op_name="jit(_threefry_fold_in)/jit(main)/or" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %xor.157 = u32[1]{0} xor(%add.153, %or.156), metadata={op_name="jit(_threefry_fold_in)/jit(main)/xor" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.160 = u32[1]{0} reshape(%Arg_0.12), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %add.161 = u32[1]{0} add(%xor.157, %reshape.160), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %constant.16 = u32[1]{0} constant({5})
  %add.162 = u32[1]{0} add(%add.161, %constant.16), metadata={op_name="jit(_threefry_fold_in)/jit(main)/add" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  ROOT %tuple.163 = (u32[1]{0}, u32[1]{0}) tuple(%add.159, %add.162)
}

ENTRY %main.168 (Arg_0.1: u32[2], Arg_1.2: u32[]) -> u32[2] {
  %Arg_0.1 = u32[2]{0} parameter(0), metadata={op_name="key"}
  %slice.7 = u32[1]{0} slice(%Arg_0.1), slice={[0:1]}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/slice" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.8 = u32[] reshape(%slice.7), metadata={op_name="jit(_threefry_fold_in)/jit(main)/squeeze" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %slice.9 = u32[1]{0} slice(%Arg_0.1), slice={[1:2]}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/slice" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.10 = u32[] reshape(%slice.9), metadata={op_name="jit(_threefry_fold_in)/jit(main)/squeeze" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %Arg_1.2 = u32[] parameter(1), metadata={op_name="data"}
  %constant.3 = u32[] constant(32)
  %shift-right-logical.4 = u32[] shift-right-logical(%Arg_1.2, %constant.3), metadata={op_name="jit(_threefry_fold_in)/jit(main)/shift_right_logical" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.5 = u32[1]{0} reshape(%shift-right-logical.4), metadata={op_name="jit(_threefry_fold_in)/jit(main)/broadcast_in_dim" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %reshape.6 = u32[1]{0} reshape(%Arg_1.2), metadata={op_name="jit(_threefry_fold_in)/jit(main)/broadcast_in_dim" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
  %call.164 = (u32[1]{0}, u32[1]{0}) call(%reshape.8, %reshape.10, %reshape.5, %reshape.6), to_apply=%threefry2x32.11
  %get-tuple-element.165 = u32[1]{0} get-tuple-element(%call.164), index=0
  %get-tuple-element.166 = u32[1]{0} get-tuple-element(%call.164), index=1
  ROOT %concatenate.167 = u32[2]{0} concatenate(%get-tuple-element.165, %get-tuple-element.166), dimensions={0}, metadata={op_name="jit(_threefry_fold_in)/jit(main)/concatenate" source_file="/home/halcyon/root/gemma_fine_tuning_ui/backend/data_pipeline.py" source_line=119}
}

